---
kind: property
id: P:Autodesk.Revit.UI.Events.ViewActivatingEventArgs.CurrentActiveView
source: html/cfbe7425-93c0-da78-21c6-43ac212ab3d6.htm
---
# Autodesk.Revit.UI.Events.ViewActivatingEventArgs.CurrentActiveView Property

The view that is currently active.

## Syntax (C#)
```csharp
public View CurrentActiveView { get; }
```

## Remarks
May be Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no currently active view.